src_ext/Documents/УЗ_СправкаОбОплатеОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_СправкаОбОплатеОбучения</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемПриходится</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатыСупруга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчнаяФорма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_РеквизитыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_РеквизитыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИПБезЛицензии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицензиюВыдал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПодписанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ДокументыФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ДокументыФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_СправкаОбОплатеОбучения/Ext/ManagerModule.bsl
//Справка об оплате образовательных услуг для представления в налоговый орган — форма по КНД 1151158 (приказ ФНС
//от 18.10.2023 № ЕД-7-11/755@; этап 2.1, В42). Одна справка — один налогоплательщик (кто платил), один обучающийся,
//один год (порядок заполнения, п. 2–3). Сумма — внесено минус возвращено за год этим плательщиком за этого
//обучающегося в организации — по движениям кассы «Касса ученики», как отчёт «Оплаты по плательщикам» (В37).
//Электронная передача сведений в ФНС (XML) не делается — справка печатается.

#Область ПрограммныйИнтерфейс

// Печать — точка входа подменю «Печать» (сигнатура БСП; вызывают форма печати хозяина
// и своя печать УЗ_Печать.СформироватьСвоейПечатью).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УЗ_Печать.НужноПечататьМакет(КоллекцияПечатныхФорм, "Справка") Тогда
		УЗ_Печать.ВывестиВКоллекцию(КоллекцияПечатныхФорм, "Справка",
			НСтр("ru = 'Справка об оплате образовательных услуг'"), ПечатьСправки(МассивОбъектов, ОбъектыПечати));
		УЗ_Печать.УстановитьЗаголовок(ПараметрыВывода, НСтр("ru = 'Справка об оплате образовательных услуг'"));
	КонецЕсли;

КонецПроцедуры

//Расходы на обучение за год (В42): внесено минус возвращено Налогоплательщиком (и его супругом, если справку
//просит супруг того, кто платил) за Обучающегося в Организации — движения кассы «Касса ученики» приходов и
//возвратов с датой в году (год справки — год оплаты). Плательщик движения пустого прихода — сам ученик (В35),
//поэтому взрослый, который платит за себя, — налогоплательщик и обучающийся одновременно. Бонусы — не деньги.
Функция РасходыНаОбучение(Организация, Налогоплательщик, Обучающийся, Год, ОплатыСупруга = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Налогоплательщик) Или Не ЗначениеЗаполнено(Обучающийся) Или Год < 2000 Тогда
		Возврат 0;
	КонецЕсли;
	Плательщики = Новый Массив;
	Плательщики.Добавить(Налогоплательщик);
	Если ЗначениеЗаполнено(ОплатыСупруга) Тогда
		Плательщики.Добавить(ОплатыСупруга);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА Движения.Сумма
	|				ИНАЧЕ -Движения.Сумма
	|			КОНЕЦ), 0) КАК Оплачено
	|ИЗ
	|	РегистрНакопления.УЗ_Касса КАК Движения
	|ГДЕ
	|	Движения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.КассаУченики)
	|	И Движения.Активность
	|	И (Движения.Регистратор ССЫЛКА Документ.УЗ_ПриходДенег
	|			ИЛИ Движения.Регистратор ССЫЛКА Документ.УЗ_РасходДенег)
	|	И Движения.Организация = &Организация
	|	И Движения.Плательщик В (&Плательщики)
	|	И Движения.Клиент = &Обучающийся
	|	И Движения.Период МЕЖДУ &НачалоГода И &КонецГода";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Плательщики", Плательщики);
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Запрос.УстановитьПараметр("НачалоГода", Дата(Год, 1, 1));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(Дата(Год, 1, 1)));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Макс(Выборка.Оплачено, 0), 0);

КонецФункции

//Кем налогоплательщик приходится обучающемуся — из плательщиков ученика («Кем приходится», В33); это он сам — "".
Функция КемПриходится(Обучающийся, Налогоплательщик) Экспорт

	Если Не ЗначениеЗаполнено(Обучающийся) Или Не ЗначениеЗаполнено(Налогоплательщик)
		Или Обучающийся = Налогоплательщик Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Плательщики.КемПриходится КАК КемПриходится
	|ИЗ
	|	Справочник.УЗ_ФизЛица.Плательщики КАК Плательщики
	|ГДЕ
	|	Плательщики.Ссылка = &Обучающийся
	|	И Плательщики.Плательщик = &Налогоплательщик";
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Запрос.УстановитьПараметр("Налогоплательщик", Налогоплательщик);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), СокрЛП(Выборка.КемПриходится), "");

КонецФункции

//Следующий номер справки за год в организации (порядок заполнения, п. 18: уникальный порядковый номер за год;
//только цифры). Корректирующая справка номер не получает — у неё номер первичной.
Функция СледующийНомерСправки(Организация, Год, Исключить = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Справки.НомерСправки), 0) КАК Номер
	|ИЗ
	|	Документ.УЗ_СправкаОбОплатеОбучения КАК Справки
	|ГДЕ
	|	Справки.Организация = &Организация
	|	И Справки.Год = &Год
	|	И Справки.Ссылка <> &Исключить";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("Исключить", Исключить);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Номер, 0) + 1;

КонецФункции

//Следующий номер корректировки справки с этим номером (п. 19: 0 — первичная, 1, 2… — корректирующие;
//аннулирующая — 999 — ставится вручную).
Функция СледующийНомерКорректировки(Организация, Год, НомерСправки, Исключить = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Справки.НомерКорректировки) КАК Номер
	|ИЗ
	|	Документ.УЗ_СправкаОбОплатеОбучения КАК Справки
	|ГДЕ
	|	Справки.Организация = &Организация
	|	И Справки.Год = &Год
	|	И Справки.НомерСправки = &НомерСправки
	|	И Справки.НомерКорректировки < 999
	|	И Справки.Ссылка <> &Исключить";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("НомерСправки", НомерСправки);
	Запрос.УстановитьПараметр("Исключить", Исключить);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Номер <> NULL Тогда
		Возврат Выборка.Номер + 1;
	КонецЕсли;
	Возврат 0;

КонецФункции

//Всё, что печатается в справке, — Структура (её же проверяет ПричиныОтказа):
//  Организация — УЗ_РеквизитыОрганизаций.РеквизитыОрганизации; Налогоплательщик, Обучающийся — ДанныеЛица;
//  ОдноЛицо, НомерСправки, НомерКорректировки, Год, ОчнаяФорма, Сумма, ПоКассе (расходы по кассе сейчас),
//  Ответственный (ФИО строкой), ДатаСправки, Страниц.
//  Справка — ДокументОбъект или структура с реквизитами справки (Ссылка, Дата, Организация, Налогоплательщик…).
Функция ДанныеСправки(Справка) Экспорт

	Данные = Новый Структура;
	Данные.Вставить("Ссылка", Справка.Ссылка);
	Данные.Вставить("ОрганизацияСсылка", Справка.Организация);
	Данные.Вставить("Организация", РегистрыСведений.УЗ_РеквизитыОрганизаций.РеквизитыОрганизации(Справка.Организация));
	Данные.Вставить("НалогоплательщикСсылка", Справка.Налогоплательщик);
	Данные.Вставить("ОбучающийсяСсылка", Справка.Обучающийся);
	Данные.Вставить("Налогоплательщик", ДанныеЛица(Справка.Налогоплательщик));
	Данные.Вставить("Обучающийся", ДанныеЛица(Справка.Обучающийся));
	Данные.Вставить("ОдноЛицо", Справка.Налогоплательщик = Справка.Обучающийся);
	Данные.Вставить("Год", Справка.Год);
	Данные.Вставить("НомерСправки", Справка.НомерСправки);
	Данные.Вставить("НомерКорректировки", Справка.НомерКорректировки);
	Данные.Вставить("ОчнаяФорма", Справка.ОчнаяФорма);
	Данные.Вставить("Сумма", Справка.Сумма);
	Данные.Вставить("ПоКассе", РасходыНаОбучение(Справка.Организация, Справка.Налогоплательщик,
		Справка.Обучающийся, Справка.Год, Справка.ОплатыСупруга));
	Ответственный = СокрЛП(Справка.Ответственный);
	Если ПустаяСтрока(Ответственный) Тогда
		Ответственный = ОтветственныйПоУмолчанию(Данные.Организация);
	КонецЕсли;
	Данные.Вставить("Ответственный", Ответственный);
	Данные.Вставить("ДатаСправки", Справка.Дата);
	Данные.Вставить("Страниц", ?(Данные.ОдноЛицо, 1, 2));
	Возврат Данные;

КонецФункции

//Кто подписывает справку по умолчанию (п. 27.1): ответственный из реквизитов организации; у ИП, который учит сам, —
//сам предприниматель; не указан — текущий пользователь программы.
Функция ОтветственныйПоУмолчанию(РеквизитыОрганизации) Экспорт

	Если Не ПустаяСтрока(РеквизитыОрганизации.Ответственный) Тогда
		Возврат СокрЛП(РеквизитыОрганизации.Ответственный);
	ИначеЕсли РеквизитыОрганизации.ЭтоИП И Не ПустаяСтрока(РеквизитыОрганизации.ФИОПредпринимателя) Тогда
		Возврат РеквизитыОрганизации.ФИОПредпринимателя;
	КонецЕсли;
	Пользователь = УЗ_Среда.ТекущийПользователь();
	Возврат ?(ЗначениеЗаполнено(Пользователь), Строка(Пользователь), "");

КонецФункции

//Отказы (массив строк; пусто — справку можно записать и напечатать). Их проверяют запись справки и печать:
//  * организация не вправе выдавать справку — нет ИНН, нет ни лицензии, ни признака «ИП без лицензии»;
//  * у налогоплательщика нет ни ИНН, ни документа, удостоверяющего личность (бланк: ИНН или документ);
//  * сумма 0 (кроме аннулирующей 999) или больше расходов по кассе (печать выданной справки с кассой не сверяет:
//    после возврата выдаётся корректирующая, а копия прежней должна печататься как была);
//  * не указан налогоплательщик, обучающийся или год.
Функция ПричиныОтказа(Данные, СверятьСКассой = Истина) Экспорт

	Причины = РегистрыСведений.УЗ_РеквизитыОрганизаций.ПричиныОтказаВСправке(Данные.Организация,
		Данные.ОрганизацияСсылка);
	Если Не ЗначениеЗаполнено(Данные.НалогоплательщикСсылка) Тогда
		Причины.Добавить(НСтр("ru = 'Укажите налогоплательщика — кто оплатил обучение.'"));
	ИначеЕсли Не РегистрыСведений.УЗ_ДокументыФизЛиц.ЕстьИННИлиДокумент(Данные.Налогоплательщик) Тогда
		Причины.Добавить(СтрШаблон(НСтр("ru = 'У налогоплательщика «%1» нет ни ИНН, ни документа, удостоверяющего "
			+ "личность: заполните их в карточке (страница «Для справки в налоговую»).'"),
			Данные.НалогоплательщикСсылка));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Данные.ОбучающийсяСсылка) Тогда
		Причины.Добавить(НСтр("ru = 'Укажите обучающегося — за чьё обучение платили.'"));
	КонецЕсли;
	Если Данные.Год < 2024 Тогда
		Причины.Добавить(НСтр("ru = 'Укажите отчётный год: справка по форме КНД 1151158 — за расходы с 2024 года.'"));
	КонецЕсли;
	Если Данные.НомерКорректировки <> 999 Тогда
		Если Данные.Сумма <= 0 Тогда
			Причины.Добавить(СтрШаблон(НСтр("ru = 'Сумма расходов за %1 год — 0: оплат этого налогоплательщика за "
				+ "этого обучающегося в организации за год нет (отчёт «Оплаты по плательщикам»).'"),
				Формат(Данные.Год, "ЧГ=")));
		ИначеЕсли СверятьСКассой И Данные.Сумма > Данные.ПоКассе Тогда
			Причины.Добавить(СтрШаблон(НСтр("ru = 'Сумма %1 больше расходов по кассе за год (%2): в справке — не "
				+ "больше того, что внесено минус возвращено.'"),
				Формат(Данные.Сумма, "ЧДЦ=2; ЧН=0,00"), Формат(Данные.ПоКассе, "ЧДЦ=2; ЧН=0,00")));
		КонецЕсли;
	КонецЕсли;
	Возврат Причины;

КонецФункции

//Предупреждения формы (не мешают записи): что проверить перед выдачей.
Функция Предупреждения(Данные, КемПриходится) Экспорт

	Тексты = Новый Массив;
	Если ЗначениеЗаполнено(Данные.НалогоплательщикСсылка)
		И Не ЗначениеЗаполнено(Данные.Налогоплательщик.ДатаРождения) Тогда
		Тексты.Добавить(НСтр("ru = 'У налогоплательщика не заполнена дата рождения.'"));
	КонецЕсли;
	Если Не Данные.ОдноЛицо И ЗначениеЗаполнено(Данные.ОбучающийсяСсылка) Тогда
		Если Не ЗначениеЗаполнено(Данные.Обучающийся.ДатаРождения) Тогда
			Тексты.Добавить(НСтр("ru = 'У обучающегося не заполнена дата рождения.'"));
		КонецЕсли;
		Если Не РегистрыСведений.УЗ_ДокументыФизЛиц.ЕстьИННИлиДокумент(Данные.Обучающийся) Тогда
			Тексты.Добавить(НСтр("ru = 'У обучающегося нет ни ИНН, ни документа (для ребёнка — свидетельство о "
				+ "рождении, код 03).'"));
		КонецЕсли;
		Родство = НРег(КемПриходится);
		Если СтрНайти(Родство, "бабушк") > 0 Или СтрНайти(Родство, "дедушк") > 0 Или СтрНайти(Родство, "тёт") > 0
			Или СтрНайти(Родство, "тет") > 0 Или СтрНайти(Родство, "дяд") > 0 Тогда
			Тексты.Добавить(СтрШаблон(НСтр("ru = 'Налогоплательщик — «%1»: вычет за обучение дают родителю, "
				+ "опекуну или попечителю, брату или сестре, супругу (ст. 219 НК РФ). Справку выдать можно — "
					+ "вычета по ней не будет, если он не опекун.'"),
				КемПриходится));
		КонецЕсли;
	КонецЕсли;
	Если Данные.НомерКорректировки <> 999 И Данные.Сумма > 0 И Данные.Сумма < Данные.ПоКассе Тогда
		Тексты.Добавить(СтрШаблон(НСтр("ru = 'По кассе за год сейчас %1 — больше суммы справки (так бывает, если "
			+ "сумму согласовали супруги).'"),
			Формат(Данные.ПоКассе, "ЧДЦ=2; ЧН=0,00")));
	КонецЕсли;
	Возврат Тексты;

КонецФункции

//Справка об оплате образовательных услуг (КНД 1151158): страница 001 и, если налогоплательщик и обучаемый — разные
//лица, страница 002 (п. 24). Справка с причиной отказа не печатается — исключение с причинами.
Функция ПечатьСправки(МассивОбъектов, ОбъектыПечати) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УЗ_СправкаОбОплатеОбучения_Справка";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ПолеСлева = 15;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = Документы.УЗ_СправкаОбОплатеОбучения.ПолучитьМакет("ПечатьСправки");

	Для Каждого Ссылка Из МассивОбъектов Цикл

		Данные = ДанныеСправки(Ссылка.ПолучитьОбъект());
		Причины = ПричиныОтказа(Данные, Ложь);
		Если Причины.Количество() > 0 Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Справка № %1 за %2 год не печатается: %3'"),
				Формат(Данные.НомерСправки, "ЧГ="), Формат(Данные.Год, "ЧГ="), СтрСоединить(Причины, " "));
		КонецЕсли;

		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Страница = Макет.ПолучитьОбласть("Страница1");
		Страница.Параметры.Заполнить(ЗнакоместаСтраницы1(Данные));
		ТабличныйДокумент.Вывести(Страница);
		Если Не Данные.ОдноЛицо Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Страница = Макет.ПолучитьОбласть("Страница2");
			Страница.Параметры.Заполнить(ЗнакоместаСтраницы2(Данные));
			ТабличныйДокумент.Вывести(Страница);
		КонецЕсли;
		УЗ_Печать.ЗадатьОбластьДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);

	КонецЦикла;

	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Фамилия, имя, отчество из наименования физ. лица (в карточке — «Фамилия Имя Отчество» одной строкой; отчество
//может быть из нескольких слов или отсутствовать), ИНН, дата рождения и документ.
Функция ДанныеЛица(ФизЛицо)

	Данные = РегистрыСведений.УЗ_ДокументыФизЛиц.ДанныеФизЛица(ФизЛицо);
	Данные.Вставить("Фамилия", "");
	Данные.Вставить("Имя", "");
	Данные.Вставить("Отчество", "");
	Данные.Вставить("ДатаРождения", Дата(1, 1, 1));
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат Данные;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФизЛица.Наименование КАК Наименование,
	|	ФизЛица.ДатаРождения КАК ДатаРождения
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Данные;
	КонецЕсли;
	Данные.ДатаРождения = Выборка.ДатаРождения;
	Слова = СтрРазделить(СокрЛП(Выборка.Наименование), " ", Ложь);
	Если Слова.Количество() > 0 Тогда
		Данные.Фамилия = Слова[0];
		Слова.Удалить(0);
	КонецЕсли;
	Если Слова.Количество() > 0 Тогда
		Данные.Имя = Слова[0];
		Слова.Удалить(0);
	КонецЕсли;
	Данные.Отчество = СтрСоединить(Слова, " ");
	Возврат Данные;

КонецФункции

Функция ЗнакоместаСтраницы1(Данные)

	Знаки = ЗнакоместаШапки(Данные);
	Организация = Данные.Организация;
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "НомерСправки", Формат(Данные.НомерСправки, "ЧГ="), 12);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "НомерКорректировки", Формат(Данные.НомерКорректировки, "ЧН=0; ЧГ="), 3);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Год", Формат(Данные.Год, "ЧГ="), 4);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Организация", Организация.НаименованиеДляСправки, 160);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ОчнаяФорма", ?(Данные.ОчнаяФорма, "1", "0"), 1);
	ДобавитьЛицо(Знаки, Данные.Налогоплательщик);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ОдноЛицо", ?(Данные.ОдноЛицо, "1", "0"), 1);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "СуммаРубли", Формат(Цел(Данные.Сумма), "ЧН=0; ЧГ="), 13);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "СуммаКопейки",
		Формат(Окр((Данные.Сумма - Цел(Данные.Сумма)) * 100), "ЧЦ=2; ЧВН=; ЧН=00; ЧГ="), 2);
	ЧастиФИО = СтрРазделить(Данные.Ответственный, " ", Ложь);
	Для Индекс = ЧастиФИО.Количество() По 3 Цикл
		ЧастиФИО.Добавить("");
	КонецЦикла;
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ОтветственныйФамилия", ЧастиФИО[0], 20);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ОтветственныйИмя", ЧастиФИО[1], 20);
	ЧастиФИО.Удалить(0);
	ЧастиФИО.Удалить(0);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ОтветственныйОтчество", СокрЛП(СтрСоединить(ЧастиФИО, " ")), 20);
	УЗ_Печать.ДобавитьДатуЗнакоместами(Знаки, "ДатаСправки", Данные.ДатаСправки);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Страниц", Формат(Данные.Страниц, "ЧГ="), 3);
	Возврат Знаки;

КонецФункции

Функция ЗнакоместаСтраницы2(Данные)

	Знаки = ЗнакоместаШапки(Данные);
	ДобавитьЛицо(Знаки, Данные.Обучающийся);
	Возврат Знаки;

КонецФункции

//ИНН и КПП организации — верх каждой страницы (п. 15–16; у ИП КПП не заполняется).
Функция ЗнакоместаШапки(Данные)

	Знаки = Новый Структура;
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ИНН", Данные.Организация.ИНН, 12);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "КПП", ?(Данные.Организация.ЭтоИП, "", Данные.Организация.КПП), 9);
	Возврат Знаки;

КонецФункции

//Фамилия, имя, отчество, ИНН, дата рождения; документ — только если ИНН нет (п. 23.2, 29.2).
Процедура ДобавитьЛицо(Знаки, Лицо)

	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Фамилия", Лицо.Фамилия, 35);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Имя", Лицо.Имя, 35);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "Отчество", Лицо.Отчество, 35);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "ИННФизЛица", Лицо.ИНН, 12);
	УЗ_Печать.ДобавитьДатуЗнакоместами(Знаки, "ДатаРождения", Лицо.ДатаРождения);
	БезДокумента = Не ПустаяСтрока(Лицо.ИНН);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "КодДокумента", ?(БезДокумента, "", Лицо.КодВидаДокумента), 2);
	УЗ_Печать.ДобавитьЗнакоместа(Знаки, "СерияНомер", ?(БезДокумента, "", Лицо.СерияНомерДокумента), 20);
	УЗ_Печать.ДобавитьДатуЗнакоместами(Знаки, "ДатаВыдачи", ?(БезДокумента, Дата(1, 1, 1), Лицо.ДатаВыдачиДокумента));

КонецПроцедуры

#КонецОбласти
